#+TITLE: FatFin Guide
#+OPTIONS: toc:5
#+PROPERTY: header-args:ruby :colnames no :session readme :hlines yes :exports both :wrap example
#+PROPERTY: header-args:sh :exports code

** ~CashPoint~ class
This gem, ~fat_fin~, defines classes for dealing with certain financial
calculations involving the time-value of money.  It's base class is
~CashPoint~ which represents a quantity of money tied to a particular date.

#+begin_src ruby
  require 'bundler/setup'
  require 'fat_fin'
#+end_src

#+RESULTS:
#+begin_example
false
#+end_example

*** Using Non-Standard Compounding

The classical NPV analysis always assumes annual compounding of interest, but
other assumptions are plausible.  So, the ~#irr~ method can be given a ~freq:~
parameter like the ~#value_on~ methods.

Like continuous compounding:

#+begin_src ruby :results output
 flow.irr(freq: :cont, verbose: true)
#+end_src

#+begin_example
Iter: 1, Guess: 0.12080824; NPV: 3896.856472004197; NPV': -46316.936578674700
Iter: 2, Guess: 0.20494283; NPV: 220.828976050425; NPV': -41181.135578639689
Iter: 3, Guess: 0.21030522; NPV: 0.818443834624; NPV': -40876.309787513594
Iter: 4, Guess: 0.21032524; NPV: 0.000011346530; NPV': -40875.176412455738
--------------------
=> 0.21032523850736937
:org_babel_ruby_eoe
#+end_example

Or, egad, simple interest:

#+begin_src ruby :results output
 flow.irr(freq: 0, verbose: true)
#+end_src

#+RESULTS:
#+begin_example
Iter: 1, Guess: 0.12080824; NPV: 4323.380986093362; NPV': 81677.018835546070
Iter: 2, Guess: 0.06787559; NPV: 6595.403324999257; NPV': 67791.417164434592
Iter: 3, Guess: -0.02941406; NPV: 11689.537313470391; NPV': 50659.077239933038
Iter: 4, Guess: -0.26016317; NPV: 33692.699830123915; NPV': 29997.484922976786
Iter: 5, Guess: -1.38334733; NPV: -84822.324157937343; NPV': 7791.568606564050
Iter: 6, Guess: 9.50307727; NPV: -33198.127092559436; NPV': 5850.688659538312
Iter: 7, Guess: 15.17730282; NPV: -35293.524919488984; NPV': 2838.334674129928
Iter: 8, Guess: 27.61189175; NPV: -37160.631861120106; NPV': 207.839657575246
Iter: 9, Guess: 206.40660444; NPV: -39568.575581203790; NPV': 2.252961512096
Iter: 10, Guess: 17769.32340030; NPV: -39994.869345812171; NPV': 0.000288983689
ArgumentError: unknown keyword: :guess
from /home/ded/src/fat_fin/lib/fat_fin/cash_flow.rb:191:in `birr'
:org_babel_ruby_eoe
#+end_example

#+begin_example
Iter: 1, Guess: 0.50000000; NPV: -17500.000000000000; NPV': -55000.000000000000
--------------------
=> 0.18181818181818182
#+end_example

*** Subsetting ~CashFlow~ with ~#within(period)~
The ~#within#~ method allows you to get a ~CashFlow~ object that consists of
only those ~CashPoints~ that fall within a given ~Period~.  The ~fat_fin~ gem
includes ~fat_period~ which defines a ~Period~ class representing a range of
dates. (See [[https://github.com/ddoherty03/fat_period][FatPeriod gem github page]]).

The ~#within~ method takes a ~Period~ parameter and returns a new ~CashFlow~
that contains only those ~CashPoints~ that fall within the given period.
There is a twist, however: it adds a ~CashPoint~ dated the first date of the
period that have a value equal to the ~#value_on~ that date of all
~CashPoint~s that preceded the beginning of the given period.  That way, all
investment activity leading up to the given period is encapsulated in a single
~CashPoint~ at the beginning of the period.

Recall that our ~flow~ example has the following ~CashPoint~s:

#+begin_example
| Date       |     Amount |
|------------+------------|
| 2022-01-15 | -40,000.00 |
| 2022-02-15 |   2,000.00 |
| 2022-03-15 |   2,000.00 |
| 2022-04-15 |   2,000.00 |
| 2022-05-15 |   2,000.00 |
| 2022-06-15 |   2,000.00 |
| 2022-07-15 |   2,000.00 |
| 2022-08-15 |   2,000.00 |
| 2022-09-15 |   2,000.00 |
| 2022-10-15 |   2,000.00 |
| 2022-11-15 |   2,000.00 |
| 2022-12-15 |   2,000.00 |
| 2023-01-15 |   2,000.00 |
| 2023-02-15 |   2,000.00 |
| 2023-03-15 |   2,000.00 |
| 2023-04-15 |   2,000.00 |
| 2023-05-15 |   2,000.00 |
| 2023-06-15 |   2,000.00 |
| 2023-07-15 |  -3,000.00 |
| 2023-08-15 |   2,000.00 |
| 2023-09-15 |   2,000.00 |
| 2023-11-15 |  15,000.00 |
#+end_example

We can take subsets of if by passing the period of interest to ~#within~.  If
we wanted to look at performance during the third quarter of 2022, for
example, we could do this:

#+begin_src ruby
  q3 = Period.parse('2022-3Q')
  flow3q = flow.within(q3)

  # Format it all as a table
  tab = [["Date", "Amount"], nil]
  flow3q.time_values.each do |cp|
    tab << [cp.date.iso, cp.amount.commas(2)]
  end
  tab
#+end_src

#+RESULTS:
#+begin_example
| Date | Amount |
|------+--------|
#+end_example

that part Return a new CashFlow that narrows this CashFlow to the given period.  All
CashPoints before the beginning of the period are rolled up into a single
CashPoint having a date of the beginning of the period and an amount that
represents their value_on that date.  All the CashPoints that fall within the
period are retained and any CashPoints that are beyond the last date of the
period are dropped.


